iscsi_replicated_pg_256_MaxDataAreaMB_1024M/iscsi_libaio_1024_randread_4k.log
iscsi_libaio_1024_randread_4k: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1024
fio-3.1
Starting 1 process

iscsi_libaio_1024_randread_4k: (groupid=0, jobs=1): err= 0: pid=3316642: Mon Jun 29 01:09:13 2020
   read: IOPS=10.8k, BW=42.1MiB/s (44.2MB/s)(24.7GiB/600289msec)
    slat (usec): min=7, max=2098.4k, avg=87.45, stdev=6126.03
    clat (msec): min=35, max=4421, avg=94.85, stdev=220.77
     lat (msec): min=35, max=4421, avg=94.94, stdev=220.89
    clat percentiles (msec):
     |  1.00th=[   42],  5.00th=[   45], 10.00th=[   46], 20.00th=[   49],
     | 30.00th=[   52], 40.00th=[   54], 50.00th=[   56], 60.00th=[   59],
     | 70.00th=[   62], 80.00th=[   67], 90.00th=[   80], 95.00th=[  146],
     | 99.00th=[ 1452], 99.50th=[ 1569], 99.90th=[ 2265], 99.95th=[ 2802],
     | 99.99th=[ 3473]
   bw (  KiB/s): min=  256, max=86696, per=100.00%, avg=52078.62, stdev=27291.46, samples=994
   iops        : min=   64, max=21674, avg=13019.63, stdev=6822.86, samples=994
  lat (msec)   : 50=25.46%, 100=67.03%, 250=4.58%, 500=0.43%, 750=0.30%
  lat (msec)   : 1000=0.15%, 2000=1.83%, >=2000=0.21%
  cpu          : usr=3.72%, sys=17.38%, ctx=2071009, majf=0, minf=161935
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=6472613,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1024

Run status group 0 (all jobs):
   READ: bw=42.1MiB/s (44.2MB/s), 42.1MiB/s-42.1MiB/s (44.2MB/s-44.2MB/s), io=24.7GiB (26.5GB), run=600289-600289msec